app/views/memberships/index.html.erb

      <tr>
        <td><%= membership.group.name %></td>
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1