app/views/groups/index.html.erb

SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 2 LIMIT 1
---
  <p id=<%= member.id%>>
   <% if group.id == member.group.id %>