app/views/orders/index.html.erb

      <tr>
        <td><%= order.order_for %></td>
---
SELECT `orders`.* FROM `orders`