app/controllers/groups_controller.rb

   def index
    @groups = Group.where('owner_id' => current_user.id)
    @memberships = Membership.all
---
SELECT  `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `memberships`.* FROM `memberships`

  def create
    @user = current_user
    @group = Group.new(group_params)
    @group.save
---
INSERT INTO `groups` (`name`, `owner_id`, `created_at`, `updated_at`) VALUES ('EL', 1, '2016-05-23 14:41:44', '2016-05-23 14:41:44')

  def update
    @group.update(group_params)
---
UPDATE `groups` SET `name` = 'OS', `updated_at` = '2016-05-23 14:41:16' WHERE `groups`.`id` = 4

  def destroy
    @group.destroy
---
DELETE FROM `groups` WHERE `groups`.`id` = 1