app/controllers/memberships_controller.rb

SELECT `groups`.* FROM `groups`
---
  def new
    @membership = Membership.new
    @groups = Group.all