app/controllers/memberships_controller.rb

  def index
    @memberships = Membership.all
---
SELECT `memberships`.* FROM `memberships`

  def new
    @membership = Membership.new
    @groups = Group.where('owner_id' => current_user.id)
    @users = User.all
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`owner_id` = 1
SELECT `users`.* FROM `users`

  def create
    @membership = Membership.new(membership_params)
    @membership.save
---
INSERT INTO `memberships` (`group_id`, `user_id`, `created_at`, `updated_at`) VALUES (3, 1, '2016-05-23 11:18:01', '2016-05-23 11:18:01')

  def destroy
    @membership.destroy
---
DELETE FROM `memberships` WHERE `memberships`.`id` = 37

    def set_membership
      @membership = Membership.find(params[:id])
---
SELECT  `memberships`.* FROM `memberships` WHERE `memberships`.`id` = 103 LIMIT 1